import { Container } from './stack';
import LeftHeader from '@Components/Header/LeftHeader';
import React from 'react';
import styled from 'styled-components';

const Introduce = () => {
  return (
    <div style={{ display: 'grid', gridTemplateColumns: `1fr 2fr` }}>
      <LeftHeader />
      <Container>
        <InnerBox>
          <h1 style={{ textAlign: 'center' }}>자기소개</h1>
          <h1>🙏🏻명상</h1>
          <p>
            꿈속에서도 코딩을 한다는 말을 들어보셨습니까?
            <br />
            개발자 모임에서 이 얘기를 꺼냈더니,
            <br />
            다들 경험해봤다면서, 한참 웃으며 얘기를 했던 기억이 있습니다.
            <br />
          </p>
          <p>
            심지어 어떤분은 자다가
            <br />
            문제 해결방안이 떠올라
            <br />
            침대에서 벌떡 일어나, 컴퓨터 앞에 앉아
            <br />
            문제를 해결했다는 얘기를 하며, 엄청 좋아하셨습니다.
          </p>

          <p>
            저도 개발자로서, 완전한 공감했습니다.
            <br />
            작사가, CEO, 만화가, 작가 등
            <br />
            새로운 아이디어를 필요로 하는 직군에 종사하는 사람들의 얘기를 들어보면
            <br />
            좋은 아이디어는 머리를 짜낼 때보다
            <br />
            예기치 않은 순간에 떠오른다고 합니다.
          </p>

          <p>
            집중해서, 머리가 이미 과부화된 상태이지만
            <br />
            직장에서 새로운 문제가 주어졌을 때
            <br />
            여러분은 어떤 방법을 택하시겠습니까?
            <br />
          </p>

          <p>
            머리가 과부화됐음을 모른다면, 머리를 쥐어짜며
            <br />
            "왜 안되지?", "다른 방법은 없을까?", "나는 역시 안돼" 라는 말들을 하며
            <br />
            문제에 대해 생각하기보다는 자기비하, 걱정을 하기 마련입니다.
          </p>

          <p>
            머리를 식히기 위해서 산책을 하거나
            <br />
            옥상에 올라가 담배를 피거나 하시는 분들도 계실 겁니다.
            <br />
            이러한 방법들도 머리를 식히는 데에 도움이 될지는 모르겠지만,
            <br />더 체계적인 방법이 필요하다고 생각합니다.
          </p>

          <p>
            저는 머리를 식히기 위해서 명상을 합니다.
            <br />
            문제해결을 위해 명상을 한다는 건, 명상의 본래의 취지와 벗어나기 때문에
            <br />
            존카밧진이 만든 마음챙김(MBSR)을 한다는 고 표현하는 게 더 적합할 듯합니다.
          </p>
          <p>
            구글 엔지니어인 '차드멩탄'의 얘기를 빌려보자면,
            <br />
            마음챙김 프로그램은 구글은 물론이고 세계적인 기업에서
            <br />
            업무효율을 늘리기 위해 사용한다고 합니다.
          </p>

          <p>
            마음챙김을 하게 되면, 집중력이 올라갈 뿐만 아니라,
            <br />
            감정조절, 장애물극복에 뛰어난 효과를 보이며
            <br />
            현상을 있는 그대로 받아들임으로써,
            <br />
            객관적이고 논리적인 사고를 하게 됩니다.
          </p>

          <p>
            명상을 시작한 지는 두달 쯤 됐고,
            <br />
            예전의 나와 비교했을 때 큰 성장을 이뤘고
            <br />
            시간을 효율적으로 사용하려고 노력하고 있습니다.
          </p>

          <p>
            이러한 지식들은, 직접 경험하지 않으면
            <br />
            아무런 쓸모가 없다는 사실이 가장 중요합니다.
          </p>

          <h1>🌴요가 & 🥑음식</h1>
          <p>
            요가를 하면서 정말 얻은 게 많습니다.
            <br />
            몸이 유연해지면서 마음도 정말 유연해졌습니다.
            <br />
            마음이 유연해지니 자연스럽게 인간관계가 개선됐습니다.
            <br />
            덤으로 코어근육과 체력까지 수면 시간도 줄었습니다.
          </p>

          <p>
            요가 동작을 잘 하기 위해서도 있고
            <br />
            요가를 하면서 몸과 대화를 하다 보니,
            <br />
            자연스럽게 햄버거, 라면 등 인스턴트 음식을 멀리하게 됐습니다.
          </p>

          <p>
            음식들을 경험해보고, 내 몸이 어떻게 반응하는지 살피고
            <br />내 몸에 맞는 것들은 자주 먹고, 좋지 않은 느낌이 들면 피하고
          </p>
          <p>
            핵심은 선입견없이 다양한 것들을 경험해보고
            <br />
            판단하지 않고, 나에게 어떤 반응이 오는지 살필 뿐입니다.
          </p>

          <p>
            자연스럽게 -10kg의 체중감량도 되고
            <br />
            명상에 더 집중할 수 있게되고 요가자세가 더 잘 나오고
            <br />
            지난 두달간은 선순환의 연속이였습니다.
          </p>

          <p>
            저에게는 요가,음식,명상에 관한 경험들이
            <br />
            지난 6~7년간의 경험보다 더 소중하다고 느낍니다.
            <br />
            조금이나마 아이처럼 기뻐하고, 삶을 즐길 수 있게 됐습니다.
          </p>
          <p>제 글이 유용한 정보가 됐으면 좋겠습니다.</p>

          <h1>💻코딩</h1>
          <p>
            코딩을 시작한 이유는
            <br />
            서비스를 만들고 싶다는 막연한 생각이 있었는데,
            <br />
            돈을 투자해서 하기에는 지식도 없고 돈도 없으니
            <br />
            배워보자라고 마음을 먹었습니다.
          </p>
          <p>
            시각적인 아름다움을 만들어 내는 게 너무 재밌습니다.
            <br />
            지금은 상상을 입체적인 요소로 표현하기 위해
            <br />
            "모방은 창조의 어머니다"라고 생각하며
            <br />
            열심히 실력을 키워나가고 있는 과정에 있습니다.
          </p>
          <p>
            지금도 그렇지만, 앞으로는 더욱더
            <br />
            기계가 사람이 하는 일을 대체할 수 있게 될 겁니다.
            <br />
            프론트엔드 시장에서 오직 사람만이 할 수 있는 분야를
            <br />잘 개발하는 것이 제가 나아가야 할 길이라고 생각합니다.
            <br />긴 글 읽어주셔서 감사합니다.
            <br />
            오늘도 좋은하루 되십시오.
          </p>
        </InnerBox>
      </Container>
    </div>
  );
};

export default Introduce;

const InnerBox = styled.div`
  width: 80%;
  padding: 2rem;
  box-shadow: rgba(48, 34, 34, 0.56) 0px 22px 70px 4px;
  justify-content: center;
  align-items: center;
  h1 {
    font-size: 40px;
    font-weight: bold;
    margin: 2rem 0;
  }
  hr {
    margin-bottom: 1rem;
  }
  h2 {
    font-size: 30px;
    font-weight: bold;
    margin-bottom: 1rem;
  }
  padding-bottom: 6rem;
  img {
    margin: 1rem 0;
    max-width: 500px;
  }
  p {
    margin-bottom: 1rem;
  }
`;
